{"pageProps":{"academyData":{"id":"academy-for-data-science","title":"Academy For Data Science","study_programs":[{"id":"data-scientist","title":"Data Scientist","price":2350,"overview":"This curriculum is focused on the latest Data Science & Machine Learning technologies combined with traditional data analytics & visualizations concepts. Having in mind that a good Data Scientist means not only being fluent with the latest frameworks and tools, but also having an evolved intuition for data analysis, representations & modeling that are efficient, secure, maintainable & explainable, the study methodology has an ideal balance between these crucial components. At the end of this 2 semesters study program you will develop an equivalent skill set and knowledge as an entry level Data Scientist/Machine Learning Practitioner for the exciting and in-demand Data Science/Machine Learning industry.","job_opportunities":"Data Scientist, Data Analyst, Business Intelligence Analyst, Data Engineer, Data Consultant","trainers":"Trainers are experienced and passionate Data Scientists & Machine Learning experts who love to teach. Holders of various relevant certificates (where applicable) for the subjects they are entitled and eligible to lecture. Some of the subjects have both trainers and assistants, whose job is to ease the learning process, introduce some learning, coding and data analysis techniques and share their hands-on experience in entering the Data Science world of opportunities.","timeline":{"duration":"8 months","classes":252,"lectures":"Lectures: Twice a week from 5:30 pm until 8:00 pm and every 2nd Friday","semesters":[{"list_title":"Skopje","list_data":["Start date: 15.10.2021 – 13.06.2022"]}]},"competencies":{"list_title":"Competencies","list_data":["Working on data visualization using latest modern web technologies such as: Tableau, Power BI, Kibana…","Developing prediction models using popular development frameworks such as TensorFlow, Pytorch…","EDA-focused technologies with the corresponding tools and environment","Develop modern and reliable Data Pipelines","Working with latest version of PyCharm, Spyder & Jupyter Notebook/Lab","Deep understanding of Data Analysis concepts and Data Analysis programming languages, primarily working with Python","Working with Python Data Analysis Frameworks & Packages","Understanding proper usage of relevant data patterns, principles and paradigms","Working as a Data Scientist/Machine Learning Practitioner covering Data ingestion, Data wrangling/munging, Data visualization & representation, Data Modeling","Working with relational and non-relational Database Management Systems (RDBMS, ElasticSearch, Hadoop)","Developing Cloud-ready, scalable and performant models","Deep understanding of Machine Learning concepts","AI ethics"]},"target_audience":{"list_title":"Target Audience","list_data":["Software Developers","Database Developers","Business Analysts","Finance Roles"]},"prerequisites":{"list_title":"Prerequisites","list_data":["General Programming Concepts","Basic Programming Experience","Love for Analytics & Data","Thirst for Knowledge"]}}]}},"__N_SSG":true}